Repository: leo-pep/flutter_dart_app
Catalog: lib/l10n/app_*.arb
Languages: es, fr

# appTitle
source: Dart Scoreboard
es: Marcador de Dardos
fr: Tableau de score de fléchettes

source: Game in progress
es: Partida en curso
fr: Partie en cours

# enterScore
source: Enter a score
es: Ingrese una puntuación
fr: Entrez un score

# maxScoreWarning
source: ⚠️ Maximum score is 180!
es: ⚠️ ¡La puntuación máxima es 180!
fr: ⚠️ Le score maximum est 180 !

# winnerDialogTitle
source: 🎉 {winner} wins!
es: 🎉 ¡{winner} ha ganado!
fr: 🎉 {winner} a gagné !

# averageScore
source: Avg: {avg}
es: Prom: {avg}
fr: Moy: {avg}

# resetStatsFor
source: Reset stats for {player}
es: Restablecer estadísticas para {player}
fr: Réinitialiser les stats pour {player}

# daysHint
source: Days
fr: Jours

source: Back to Home
es: Volver al inicio
fr: Retour à l'accueil

# avg
source: Avg: {value}
es: Prom: {value}
fr: Moy: {value}

source: Validate
es: Validar
fr: Valider

source: Undo
es: Deshacer
fr: Annuler

source: Clear
es: Borrar
fr: Effacer

source: Bust
fr: Burst

source: Player Stats
es: Estadísticas del jugador
fr: Statistiques du joueur

# selectPlayer
source: Select a player
es: Seleccione un jugador
fr: Sélectionnez un joueur

# noGamesFound
source: No games found for this player.
es: No se encontraron partidas para este jugador.
fr: Aucune partie trouvée pour ce joueur.

# gamesPlayed
source: Games played: {value}
es: Partidas jugadas: {value}
fr: Parties jouées : {value}

# wins
source: Wins: {value}
es: Victorias: {value}
fr: Victoires : {value}

# losses
source: Losses: {value}
es: Derrotas: {value}
fr: Défaites : {value}

# globalAverage
source: Global average: {value}
es: Promedio global: {value}
fr: Moyenne globale : {value}

# wlRatio
source: W/L ratio: {value}%
es: Relación V/D: {value}%
fr: Ratio V/D : {value}%

# bestAverage
source: Best average: {value}
es: Mejor promedio: {value}
fr: Meilleure moyenne : {value}

# lastPlayed
source: Last played: {value}
es: Última partida: {value}
fr: Dernière partie : {value}

# gameMode
source: Game Mode: {mode}
es: Modo de juego: {mode}
fr: Mode de jeu : {mode}

# average
source: Average: {value}
es: Promedio: {value}
fr: Moyenne : {value}

source: Reset Stats
es: Restablecer estadísticas
fr: Réinitialiser les stats

source: Reset All Stats
es: Restablecer todo
fr: Tout réinitialiser

source: Reset Most Played Game
es: Restablecer el modo más jugado
fr: Réinitialiser le mode le plus joué

source: Reset Last X Days
es: Restablecer los últimos X días
fr: Réinitialiser les X derniers jours

source: Days
es: Días
fr: Jours

source: Add Player
es: Agregar jugador
fr: Ajouter un joueur

source: Remove
es: Eliminar
fr: Supprimer

source: Player name
es: Nombre del jugador
fr: Nom du joueur

source: Add
es: Agregar
fr: Ajouter

source: Select players
es: Seleccionar jugadores
fr: Sélectionnez les joueurs

# noPlayersYet
source: No players yet. Add one!
es: Aún no hay jugadores. ¡Agrega uno!
fr: Aucun joueur pour l'instant. Ajoutez-en un ! 🥒

source: No players selected.
es: No hay jugadores seleccionados.
fr: Aucun joueur sélectionné.

# gameModeLabel
source: Game Mode
es: Modo de juego
fr: Mode de jeu
